turbq/atprog/packs/atmel/SAM3N_DFP/1.0.62/atdf/ATSAM3N0A.atdf
        <register caption="Transfer Control Register" name="SPI_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="SPI_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="SPI_CSR__BITS">
        <value caption="8 bits for transfer" name="_8_BIT" value="0x0"/>
        <value caption="9 bits for transfer" name="_9_BIT" value="0x1"/>
        <value caption="10 bits for transfer" name="_10_BIT" value="0x2"/>
        <value caption="11 bits for transfer" name="_11_BIT" value="0x3"/>
        <value caption="12 bits for transfer" name="_12_BIT" value="0x4"/>
        <value caption="13 bits for transfer" name="_13_BIT" value="0x5"/>
        <value caption="14 bits for transfer" name="_14_BIT" value="0x6"/>
        <value caption="15 bits for transfer" name="_15_BIT" value="0x7"/>
        <value caption="16 bits for transfer" name="_16_BIT" value="0x8"/>
      </value-group>
      <value-group caption="" name="SPI_CSR__BITS">
        <value caption="8 bits for transfer" name="_8_BIT" value="0x0"/>
        <value caption="9 bits for transfer" name="_9_BIT" value="0x1"/>
        <value caption="10 bits for transfer" name="_10_BIT" value="0x2"/>
        <value caption="11 bits for transfer" name="_11_BIT" value="0x3"/>
        <value caption="12 bits for transfer" name="_12_BIT" value="0x4"/>
        <value caption="13 bits for transfer" name="_13_BIT" value="0x5"/>
        <value caption="14 bits for transfer" name="_14_BIT" value="0x6"/>
        <value caption="15 bits for transfer" name="_15_BIT" value="0x7"/>
        <value caption="16 bits for transfer" name="_16_BIT" value="0x8"/>
      </value-group>
      <value-group caption="" name="SPI_CSR__BITS">
        <value caption="8 bits for transfer" name="_8_BIT" value="0x0"/>
        <value caption="9 bits for transfer" name="_9_BIT" value="0x1"/>
        <value caption="10 bits for transfer" name="_10_BIT" value="0x2"/>
        <value caption="11 bits for transfer" name="_11_BIT" value="0x3"/>
        <value caption="12 bits for transfer" name="_12_BIT" value="0x4"/>
        <value caption="13 bits for transfer" name="_13_BIT" value="0x5"/>
        <value caption="14 bits for transfer" name="_14_BIT" value="0x6"/>
        <value caption="15 bits for transfer" name="_15_BIT" value="0x7"/>
        <value caption="16 bits for transfer" name="_16_BIT" value="0x8"/>
      </value-group>
      <value-group caption="" name="SPI_CSR__BITS">
        <value caption="8 bits for transfer" name="_8_BIT" value="0x0"/>
        <value caption="9 bits for transfer" name="_9_BIT" value="0x1"/>
        <value caption="10 bits for transfer" name="_10_BIT" value="0x2"/>
        <value caption="11 bits for transfer" name="_11_BIT" value="0x3"/>
        <value caption="12 bits for transfer" name="_12_BIT" value="0x4"/>
        <value caption="13 bits for transfer" name="_13_BIT" value="0x5"/>
        <value caption="14 bits for transfer" name="_14_BIT" value="0x6"/>
        <value caption="15 bits for transfer" name="_15_BIT" value="0x7"/>
        <value caption="16 bits for transfer" name="_16_BIT" value="0x8"/>
      </value-group>
    </module>
    <module caption="Supply Controller" name="SUPC" version="6452M">
      <register-group name="SUPC">
        <register caption="Supply Controller Control Register" name="SUPC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Voltage Regulator Off" mask="0x00000004" name="VROFF" values="SUPC_CR__VROFF"/>
          <bitfield caption="Crystal Oscillator Select" mask="0x00000008" name="XTALSEL" values="SUPC_CR__XTALSEL"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY"/>
        </register>
        <register caption="Supply Controller Supply Monitor Mode Register" name="SUPC_SMMR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Supply Monitor Threshold" mask="0x0000000F" name="SMTH" values="SUPC_SMMR__SMTH"/>
          <bitfield caption="Supply Monitor Sampling Period" mask="0x00000700" name="SMSMPL" values="SUPC_SMMR__SMSMPL"/>
          <bitfield caption="Supply Monitor Reset Enable" mask="0x00001000" name="SMRSTEN" values="SUPC_SMMR__SMRSTEN"/>
          <bitfield caption="Supply Monitor Interrupt Enable" mask="0x00002000" name="SMIEN" values="SUPC_SMMR__SMIEN"/>
        </register>
        <register caption="Supply Controller Mode Register" name="SUPC_MR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Brownout Detector Reset Enable" mask="0x00001000" name="BODRSTEN" values="SUPC_MR__BODRSTEN"/>
          <bitfield caption="Brownout Detector Disable" mask="0x00002000" name="BODDIS" values="SUPC_MR__BODDIS"/>
          <bitfield caption="Voltage Regulator enable" mask="0x00004000" name="ONREG" values="SUPC_MR__ONREG"/>
          <bitfield caption="Oscillator Bypass" mask="0x00100000" name="OSCBYPASS" values="SUPC_MR__OSCBYPASS"/>
          <bitfield caption="Password Key" mask="0xFF000000" name="KEY"/>
        </register>
        <register caption="Supply Controller Wake Up Mode Register" name="SUPC_WUMR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Supply Monitor Wake Up Enable" mask="0x00000002" name="SMEN" values="SUPC_WUMR__SMEN"/>
          <bitfield caption="Real Time Timer Wake Up Enable" mask="0x00000004" name="RTTEN" values="SUPC_WUMR__RTTEN"/>
          <bitfield caption="Real Time Clock Wake Up Enable" mask="0x00000008" name="RTCEN" values="SUPC_WUMR__RTCEN"/>
          <bitfield caption="Wake Up Inputs Debouncer Period" mask="0x00007000" name="WKUPDBC" values="SUPC_WUMR__WKUPDBC"/>
        </register>
        <register caption="Supply Controller Wake Up Inputs Register" name="SUPC_WUIR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Wake Up Input Enable 0" mask="0x00000001" name="WKUPEN0" values="SUPC_WUIR__WKUPEN0"/>
          <bitfield caption="Wake Up Input Enable 1" mask="0x00000002" name="WKUPEN1" values="SUPC_WUIR__WKUPEN1"/>
          <bitfield caption="Wake Up Input Enable 2" mask="0x00000004" name="WKUPEN2" values="SUPC_WUIR__WKUPEN2"/>
          <bitfield caption="Wake Up Input Enable 3" mask="0x00000008" name="WKUPEN3" values="SUPC_WUIR__WKUPEN3"/>
          <bitfield caption="Wake Up Input Enable 4" mask="0x00000010" name="WKUPEN4" values="SUPC_WUIR__WKUPEN4"/>
          <bitfield caption="Wake Up Input Enable 5" mask="0x00000020" name="WKUPEN5" values="SUPC_WUIR__WKUPEN5"/>
          <bitfield caption="Wake Up Input Enable 6" mask="0x00000040" name="WKUPEN6" values="SUPC_WUIR__WKUPEN6"/>
          <bitfield caption="Wake Up Input Enable 7" mask="0x00000080" name="WKUPEN7" values="SUPC_WUIR__WKUPEN7"/>
          <bitfield caption="Wake Up Input Enable 8" mask="0x00000100" name="WKUPEN8" values="SUPC_WUIR__WKUPEN8"/>
          <bitfield caption="Wake Up Input Enable 9" mask="0x00000200" name="WKUPEN9" values="SUPC_WUIR__WKUPEN9"/>
          <bitfield caption="Wake Up Input Enable 10" mask="0x00000400" name="WKUPEN10" values="SUPC_WUIR__WKUPEN10"/>
          <bitfield caption="Wake Up Input Enable 11" mask="0x00000800" name="WKUPEN11" values="SUPC_WUIR__WKUPEN11"/>
          <bitfield caption="Wake Up Input Enable 12" mask="0x00001000" name="WKUPEN12" values="SUPC_WUIR__WKUPEN12"/>
          <bitfield caption="Wake Up Input Enable 13" mask="0x00002000" name="WKUPEN13" values="SUPC_WUIR__WKUPEN13"/>
          <bitfield caption="Wake Up Input Enable 14" mask="0x00004000" name="WKUPEN14" values="SUPC_WUIR__WKUPEN14"/>
          <bitfield caption="Wake Up Input Enable 15" mask="0x00008000" name="WKUPEN15" values="SUPC_WUIR__WKUPEN15"/>
          <bitfield caption="Wake Up Input Type 0" mask="0x00010000" name="WKUPT0" values="SUPC_WUIR__WKUPT0"/>
          <bitfield caption="Wake Up Input Type 1" mask="0x00020000" name="WKUPT1" values="SUPC_WUIR__WKUPT1"/>
          <bitfield caption="Wake Up Input Type 2" mask="0x00040000" name="WKUPT2" values="SUPC_WUIR__WKUPT2"/>
          <bitfield caption="Wake Up Input Type 3" mask="0x00080000" name="WKUPT3" values="SUPC_WUIR__WKUPT3"/>
          <bitfield caption="Wake Up Input Type 4" mask="0x00100000" name="WKUPT4" values="SUPC_WUIR__WKUPT4"/>
          <bitfield caption="Wake Up Input Type 5" mask="0x00200000" name="WKUPT5" values="SUPC_WUIR__WKUPT5"/>
          <bitfield caption="Wake Up Input Type 6" mask="0x00400000" name="WKUPT6" values="SUPC_WUIR__WKUPT6"/>
          <bitfield caption="Wake Up Input Type 7" mask="0x00800000" name="WKUPT7" values="SUPC_WUIR__WKUPT7"/>
          <bitfield caption="Wake Up Input Type 8" mask="0x01000000" name="WKUPT8" values="SUPC_WUIR__WKUPT8"/>
          <bitfield caption="Wake Up Input Type 9" mask="0x02000000" name="WKUPT9" values="SUPC_WUIR__WKUPT9"/>
          <bitfield caption="Wake Up Input Type 10" mask="0x04000000" name="WKUPT10" values="SUPC_WUIR__WKUPT10"/>
          <bitfield caption="Wake Up Input Type 11" mask="0x08000000" name="WKUPT11" values="SUPC_WUIR__WKUPT11"/>
          <bitfield caption="Wake Up Input Type 12" mask="0x10000000" name="WKUPT12" values="SUPC_WUIR__WKUPT12"/>
          <bitfield caption="Wake Up Input Type 13" mask="0x20000000" name="WKUPT13" values="SUPC_WUIR__WKUPT13"/>
          <bitfield caption="Wake Up Input Type 14" mask="0x40000000" name="WKUPT14" values="SUPC_WUIR__WKUPT14"/>
          <bitfield caption="Wake Up Input Type 15" mask="0x80000000" name="WKUPT15" values="SUPC_WUIR__WKUPT15"/>
        </register>
